import streamlit as st
import pandas as pd
import plotly.graph_objs as go
import datetime
import seaborn as sb
from itertools import combinations
import matplotlib.pyplot as plt
plt.rcParams['font.family'] = 'Malgun Gothic'  # 사용할 한글 폰트 설정

ind = {"기준금리": "기준금리는 중앙은행이 시중은행에게 대출을 받을 때 적용하는 이자율입니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 소비와 투자: 기준금리가 낮을수록 대출이 유리해지므로 소비자와 기업이 대출을 더 쉽게 받아들이게 됩니다. 이는 소비와 투자를 촉진하여 경제 활동을 활성화시킵니다.\n"
    "- 인플레이션: 기준금리가 낮을수록 신용 유통량이 증가하고, 이는 소비와 투자의 증가로 이어질 수 있습니다. 그러나 이로 인해 수요가 과도하게 증가할 경우 인플레이션 압력이 발생할 수 있습니다.\n"
    "- 통화 가치: 기준금리가 높을수록 해당 국가의 통화의 가치가 상승할 가능성이 있습니다. 외국인 투자자는 높은 이자율로 인해 해당 국가의 통화를 많이 구입하게 되어 통화가치가 상승할 수 있습니다.\n"
    "- 실업률: 기준금리가 낮을수록 기업들이 투자를 늘리고 생산활동을 확대할 가능성이 있습니다. 이로 인해 실업률이 감소할 수 있습니다.\n"
    "- 환율: 기준금리가 높을수록 해당 국가의 통화는 강세를 보일 수 있습니다. 외국 투자자들은 높은 이자율을 찾아 해당 국가의 통화를 많이 수급하기 때문입니다.\n\n\n\n"
    "요약하면, 기준금리는 경제의 소비, 투자, 인플레이션, 통화가치, 실업률 및 환율에 직간접적으로 영향을 미치며, 중앙은행이 경제를 안정시키고 통제하는 데 중요한 정책 도구로 사용됩니다.",

    "금": "금속으로 구성된 귀중한 상품이며, 주로 안전 자산으로서 투자하거나 화폐와 같은 다른 자산의 대체 수단으로 사용됩니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 안전 자산으로의 역할: 금은 불확실성이 높을 때 안전 자산으로 간주됩니다. 경제 불안이나 정치적 불안이 증가할 때 투자자들은 주식이나 채권에서 금에 자금을 이동시키는 경향이 있습니다.\n"
    "- 인플레이션 피해 보호: 금은 가치가 안정적이고 물가 상승에 영향을 받지 않는 자산으로 여겨집니다. 따라서 인플레이션이 증가하면 금 수요도 증가할 수 있습니다.\n"
    "- 통화 가치: 금은 통화의 대체물로 사용될 수 있습니다. 통화의 가치가 하락하거나 통화가치가 불안정할 때 금에 대한 수요가 증가할 수 있습니다.\n"
    "- 경제 위기 대비 수단: 금은 경제적으로 어려운 시기에 대한 보험 수단으로 사용될 수 있습니다. 금은 금융 시장의 변동성이나 화폐 가치 하락에 대한 보호 장치로 간주됩니다.\n"
    "- 경제 활동 지표: 금값은 종종 경기 전망과 경제적 불확실성에 대한 지표로 사용됩니다. 금값이 상승하면 일반적으로 경기가 불안정하고 불확실성이 높다는 것을 시사할 수 있습니다.",

    "달러": "달러는 전 세계적으로 널리 사용되는 통화입니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 무역 및 국제 거래: 달러는 국제 무역 및 금융 거래에서 주요한 통화로 사용됩니다. 많은 국가들이 국제 거래 시 달러를 사용하고, 국제 결제나 유가 등 많은 상품의 가격은 달러로 결정됩니다. 따라서 달러의 가치 변동은 세계 경제에 큰 영향을 미칩니다.\n"
    "- 통화 가치: 달러의 가치 변동은 다른 통화와의 환율에 영향을 줍니다. 미국의 경제 상황, 통화 공급량, 정책 변화 등이 달러의 가치에 영향을 미치며, 이는 국제 시장에서의 달러의 가치 변동으로 이어집니다.\n"
    "- 국제 투자 및 자금 이동: 달러는 국제적으로 안정적인 자산으로 인식되어 국제 투자의 주요 통화로 사용됩니다. 세계 각국의 투자자들은 안전한 자산으로서 달러를 선호하며, 경제 불안이나 위험이 증가할 때 자금이 달러로 이동하는 경향이 있습니다.\n"
    "- 미국의 경제 정책 영향: 미국의 통화 및 재정 정책 변화는 달러의 가치 및 국제 금융 시장에 영향을 미칩니다. 미국의 중앙은행인 연방준비은행(Fed)의 기준금리 결정이나 재정 정책 변화는 달러의 가치와 국제 금융 시장에 영향을 줄 수 있습니다.\n"
    "- 국제적인 영향: 미국의 경제 상황이나 정책 변화는 국제적으로 다양한 영향을 미칩니다. 미국 경제의 성장 또는 침체는 세계 경제에 파급효과를 미치며, 이는 국제 금융 시장에서의 달러 사용 및 가치에 영향을 줄 수 있습니다.",

    "엔": "엔화는 일본의 공식 화폐이며, 국제 화폐 시장에서 중요한 역할을 합니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 수출 및 수입: 엔화의 가치 변동은 일본의 수출 및 수입에 직접적인 영향을 미칩니다. 엔화가 강세를 보이면 외국에서 일본 제품을 구매하는 데 드는 비용이 증가하므로 수출 기업에게 불리할 수 있습니다. 반대로 엔화의 가치 하락은 일본의 수출 증가에 도움을 줄 수 있습니다.\n"
    "- 관광 산업: 엔화의 가치 변동은 일본으로의 관광객 수에도 영향을 미칩니다. 엔화가 약세를 나타내면 외국인 관광객들이 일본으로의 여행을 늘릴 가능성이 있으며, 이는 일본의 관광 산업에 긍정적인 영향을 미칠 수 있습니다.\n"
    "- 외환 시장: 엔화는 국제 외환 시장에서 널리 거래되는 주요 통화 중 하나입니다. 엔화의 가치 변동은 외환 시장 전반에도 영향을 미치며, 글로벌 경제의 안정성과 관련된 요인들에 의해 영향을 받을 수 있습니다.\n"
    "- 경제 정책: 엔화의 가치는 일본의 중앙은행인 일본은행의 통화정책에도 영향을 받습니다. 일본은행이 통화의 공급량을 조절하거나 기준금리를 조정할 때 엔화의 가치가 변할 수 있습니다.\n"
    "- 국제 경제 관계: 엔화의 가치는 다른 국가와의 무역 및 경제적 관계에도 영향을 미칩니다. 엔화의 변동은 국제 경제 시스템에서의 일본의 입지와 경쟁력에 영향을 줄 수 있습니다.",

    "유로": "유로는 유럽 연합(EU) 국가들이 사용하는 공식 화폐이며, 국제 화폐 시장에서 중요한 역할을 합니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 유럽 경제의 안정성: 유로는 유럽 국가들 간의 무역 및 경제적 통합을 촉진합니다. 따라서 유로의 안정성은 유럽 전체의 경제 안정성에 영향을 미칩니다. 유로가 강세를 보일 경우 유럽의 경제적 활동이 촉진될 수 있습니다.\n"
    "- 국제 무역 및 투자: 유로는 국제 무역 및 투자에서 중요한 역할을 합니다. 유로가 강세를 나타내면 유럽에서의 수출이 저하될 수 있으며, 반대로 유로가 약세를 보이면 수출이 증가할 수 있습니다.\n"
    "- 유럽 중앙은행의 정책: 유로는 유럽 중앙은행(ECB)의 통화정책에 직접적으로 영향을 받습니다. ECB는 유로존의 통화정책을 결정하고 유로의 가치와 안정성을 유지하기 위해 다양한 정책을 시행합니다.\n"
    "- 국제 경제 관계: 유로는 국제 경제 시스템에서 중요한 역할을 합니다. 유로의 가치 변동은 다른 국가와의 무역 및 경제적 관계에도 영향을 미치며, 국제 경제 시스템 전반에 영향을 미칠 수 있습니다.\n"
    "- 통화 가치: 유로의 가치는 국제 금융 시장에서 다른 통화와의 비교에 의해 결정됩니다. 따라서 유로의 가치 변동은 유럽 경제의 경쟁력과 국제 시장에서의 지위에도 영향을 미칠 수 있습니다.",

    "실업률": "경제에서 일자리를 찾고 있는 인구 중에서 실제로 일자리를 찾지 못하고 있는 인구의 비율을 나타냅니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 소비 및 수요: 실업률이 높을수록 소비자의 구매력이 감소하고, 소비가 줄어들 수 있습니다. 이는 생산품과 서비스에 대한 수요 감소로 이어져 경제 활동이 둔화될 수 있습니다. 실업률이 낮아질수록 소비자의 구매력과 소비가 증가하며, 경제에 긍정적인 영향을 줄 수 있습니다.\n"
    "- 투자 및 생산: 고용 상황이 좋을수록 기업들은 더 많은 투자를 하고 새로운 고용 기회를 창출할 가능성이 높아집니다. 이는 생산량과 생산력의 증가로 이어져 경제 성장을 촉진할 수 있습니다. 그러나 실업률이 높아지면 기업들은 투자를 줄이고 생산량을 축소할 가능성이 있으며, 이는 경제의 침체를 야기할 수 있습니다.\n"
    "- 소득 및 빈곤: 실업률이 높아지면 노동 시장에서의 경쟁이 심화되고, 노동자들의 임금이 하락할 수 있습니다. 이는 가계소득이 감소하고 빈곤율이 증가할 수 있습니다. 반면에 실업률이 낮아지면 노동자들의 임금이 상승하고 가계소득이 증가할 수 있으며, 이는 소비와 경제 활동을 촉진할 수 있습니다.\n"
    "- 정부 정책: 실업률이 높아지면 정부는 고용 창출을 위한 정책을 적극적으로 시행할 수 있습니다. 이는 고용 시장을 지원하고 실업률을 낮추는 데 도움이 될 수 있습니다. 반면에 실업률이 낮아지면 정부는 인플레이션 등의 경제 문제에 대응하기 위한 정책을 시행할 수 있습니다",

    "소비자물가지수": "소비자가 일상적인 상품과 서비스를 얼마나 비쌀지를 측정하는 지표로, 소비자물가의 상승세를 나타냅니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 인플레이션 관리: 소비자물가지수는 인플레이션의 수준을 파악하는 데 중요한 지표입니다. 과도한 인플레이션은 통화가치의 하락과 소비자 구매력의 저하를 초래할 수 있으므로, 정부와 중앙은행은 소비자물가지수를 모니터링하여 인플레이션을 관리합니다.\n"
    "- 경제 정책 결정: 소비자물가지수는 정부와 중앙은행이 경제 정책을 결정하는 데 중요한 근거가 됩니다. 인플레이션이 과도하게 높거나 낮을 경우, 이에 따른 조치를 취하여 경제를 안정시키고 인플레이션을 관리하는 데 활용됩니다.\n"
    "- 소비자 심리와 소비 행태: 소비자물가지수가 상승할 경우, 소비자들은 물가 상승에 대응하기 위해 소비를 줄일 수 있습니다. 이는 소비 행태와 소비자 심리에 영향을 미치며, 경제 활동에 변화를 가져올 수 있습니다.\n"
    "- 금융 시장 변동: 소비자물가지수의 변화는 금융 시장에도 영향을 줄 수 있습니다. 물가 상승이 예상될 경우, 이에 대한 대응으로 중앙은행의 정책 변화가 예상될 수 있으며, 이는 주식 시장이나 외환 시장 등 다양한 금융 자산의 가격에 영향을 미칠 수 있습니다.\n\n\n\n"
    "요약하면, 소비자물가지수는 경제의 인플레이션 관리와 경제 정책 결정뿐만 아니라 소비자 심리와 금융 시장에도 영향을 미치는 중요한 지표입니다.",

    "kospi": "한국 증권 거래소(KRX)에서 거래되는 모든 종목의 종합 주가지수로, 한국의 주식 시장 전반의 건강을 나타냅니다. 경제에 미치는 영향은 다음과 같습니다.\n"
    "- 경제 신뢰 지표: 코스피는 한국 경제의 건강 상태와 기업 신뢰도를 반영하는 중요한 지표입니다. 코스피가 상승할 경우, 이는 투자자들이 한국 경제에 대한 신뢰를 보이고 기업에 투자하는 경향이 높아진다는 것을 시사합니다.\n"
    "- 기업 가치 평가: 코스피는 한국 기업들의 시장 가치를 나타내는 지표로 사용됩니다. 코스피 지수의 상승은 주식 시장에서 기업들의 가치 평가가 상승하는 것을 의미하며, 이는 기업의 성장과 경제의 안정을 반영합니다.\n"
    "- 투자 심리와 소비: 코스피 지수는 투자자들의 심리와 소비에도 영향을 미칩니다. 코스피가 상승할 경우, 투자자들은 더 많은 자산을 투자하고 소비를 증가시키는 경향이 있습니다. 이는 경제의 활성화와 소비 증가를 견인합니다.\n"
    "- 외국인 투자자의 관심: 코스피는 국제적인 투자자들에게도 중요한 관심 대상입니다. 한국 경제의 성장과 기업의 수익성에 대한 지표로 사용되며, 외국 투자자들의 투자 결정에 영향을 줄 수 있습니다.\n"
    "- 경제 정책의 반영: 코스피 지수는 경제 정책의 효과를 반영하는데 사용될 수 있습니다. 정부나 중앙은행의 경제 정책 변화가 코스피에 미치는 영향을 모니터링하여 경제 정책의 효과를 분석하고 평가할 수 있습니다.\n"
    "- 요약하면, 코스피는 한국 경제의 건강 상태와 기업 신뢰도를 나타내는 주요 지표로서, 경제의 신뢰도, 기업 가치, 투자 심리, 외국인 투자 등 다양한 측면에서 경제에 영향을 미칩니다.",

    "거래대금(억)": "코스피 거래대금은 한국 증권 거래소(KRX)에서 발생한 거래의 총액을 나타내는 지표입니다. 이는 주식 시장에서 발생한 거래 활동의 규모를 나타내며, 주식 시장의 활성도와 유동성을 평가하는 중요한 지표 중 하나입니다.\n"
    "- 경기 상황 파악: 코스피 거래대금은 시장에서의 활발한 거래를 나타내므로, 이를 통해 경기 상황을 파악할 수 있습니다. 거래대금이 늘어날수록 시장 참여자들의 투자 의지가 높아지는 것을 의미할 수 있으며, 이는 경제의 활성화와 성장에 긍정적인 영향을 줄 수 있습니다.\n"
    "- 투자 심리: 거래대금이 높을수록 시장 참여자들의 투자 심리가 긍정적으로 반영될 가능성이 있습니다. 이는 투자자들이 주식 시장에 대한 신뢰를 가지고 있고, 자금을 투입할 의향이 높다는 것을 의미합니다. 이러한 긍정적인 투자 심리는 경제 활동을 촉진하고 기업들의 자금 조달을 원활하게 할 수 있습니다.\n"
    "- 자본시장 발전: 거래대금이 늘어날수록 자본시장의 발전에 기여할 수 있습니다. 높은 거래대금은 시장의 유동성을 향상시키고 투자 기회를 확대시킵니다. 이는 기업들이 자금을 조달하기 쉽고 저렴하게 만들어주어 경제의 성장을 촉진할 수 있습니다.\n"
    "- 경제 지표 분석: 코스피 거래대금은 경제 지표 중 하나로 활용될 수 있습니다. 거래대금의 추이를 분석하고 해석함으로써 투자자들은 경제 상황의 변화를 예측하고 투자 전략을 수립할 수 있습니다. 이는 경제의 미래 전망에 대한 신뢰를 높이고 경제의 안정성을 향상시키는 데 도움이 될 수 있습니다.",

    "외국인 순매수(억)": "코스피 외국인 순매수는 한국 증시에서 외국 투자자들이 주식을 매수한 후 판매한 금액의 차이를 나타냅니다. 이는 외국 투자자들이 한국 증시에 대한 투자 의지를 나타내는 지표 중 하나입니다.\n"
    "- 자본 유입: 외국 투자자들의 순매수는 한국 자본시장으로의 자본 유입을 의미합니다. 이는 한국 기업들이 자금을 조달하는데 도움을 줄 수 있으며, 경제 성장을 지원하는데 기여할 수 있습니다.\n"
    "- 주가 상승: 외국 투자자들의 매수가 증가하면 주식 시장에서 주가 상승 압력이 높아질 수 있습니다. 주가 상승은 기업의 가치 증가를 의미하며, 이는 기업의 투자 및 성장을 지원하는 긍정적인 요인이 될 수 있습니다.\n"
    "- 환율 영향: 외국 투자자들의 자금 유입은 환율에도 영향을 줄 수 있습니다. 외국 투자가 증가하면 해당 국가의 통화 수요가 늘어나게 되어 환율이 상승할 수 있습니다. 이는 수출기업들에게는 불리할 수 있지만, 해외 투자의 유치와 함께 한국 경제의 국제화에 도움을 줄 수 있습니다.\n"
    "- 금융 시장 안정성: 외국 투자자들의 참여는 한국 금융 시장의 안정성을 높일 수 있습니다. 다양한 투자자들의 참여는 시장의 유동성을 증가시키고 자금의 효율적인 이용을 도모할 수 있습니다.\n"
    "- 정책의 영향: 외국 투자자들의 행동은 종종 국내 정책에도 영향을 줄 수 있습니다. 외국인 투자자들의 매수가 강하면 정부나 중앙은행이 경제 정책을 조절할 때 이를 고려해야 합니다. 이러한 상황에서는 외국인의 투자 행태가 한국 경제의 안정성 및 성장에 영향을 미칠 수 있습니다.",

    "시가총액(억)": "코스피 시가총액은 한국 증권 거래소(KRX)에서 상장된 모든 종목의 시가총액의 총합을 의미합니다. 시가총액은 각 종목의 시장 가격을 그 종목의 총 발행 주식 수로 곱하여 계산됩니다.\n"
    "- 투자 심리와 기업 투자: 코스피 시가총액이 증가하면, 투자자들의 신뢰가 높아지고 기업들도 향후 성장에 대한 투자를 늘릴 가능성이 있습니다. 이는 경제에 긍정적인 신호를 보내며, 향후 경제 성장을 촉진할 수 있습니다.\n"
    "- 자본 시장 유동성: 코스피 시가총액이 확대되면, 주식 시장의 유동성도 증가할 수 있습니다. 이는 기업들이 자금을 조달하기 쉬워지고 투자자들이 주식 시장에서 거래를 활발히 할 수 있는 환경을 조성합니다.\n"
    "- 소비자 신뢰와 소비: 주식 시장이 성장하고 코스피 시가총액이 증가하면, 소비자들의 경기 회복에 대한 신뢰도 높아질 수 있습니다. 이는 소비자들이 소비를 촉진하고 경기를 활성화할 수 있습니다.\n"
    "- 국내외 투자자의 관심: 코스피 시가총액이 증가하면 국내외 투자자들의 관심도 증가할 수 있습니다. 이는 외국 투자자들이 한국 경제에 대한 긍정적인 전망을 가질 가능성을 높이고 국내 투자자들도 주식 시장에 더 많은 자금을 투입할 수 있습니다.\n"
    "- 경제 성장률 예측: 코스피 시가총액의 증가는 종종 경제의 성장을 예측하는 지표로 사용됩니다. 주식 시장이 성장하면 기업들의 실적이나 경제의 미래 전망에 대한 긍정적인 기대감이 반영되어 경제의 성장률을 예상할 수 있습니다."}

def corr():
    st.title('경제지표에 따른 코스피 가격 변화 및 상관계수를 보여줍니다.')
    st.image('https://eiec.kdi.re.kr/userdata/nara/202207/aaa3kilizDpHqeOtLMfgy20220629105046dhqcs.jpg',use_column_width=True)
    df=pd.read_csv('지표10.csv')
    

    # 중간 인덱스부터 끝까지의 행 출력
    df.set_index(df.columns[0], inplace=True)
    df.index.name = None
    st.dataframe(df[::-1])
    df2=df.copy()
    df2.index=df2.index.str.replace('-','').astype(int)
    
    radio=st.radio(label = '용어 설명', options = df.columns)
    st.info(ind[radio])
    st.write('<style>div.row-widget.stRadio > div{flex-direction:row;}</style>', unsafe_allow_html=True)
    select=st.selectbox('선택하신 지표의 차트를 출력합니다.',df.columns)

    
    min_date = datetime.date(2018, 12, 3)
    max_date = datetime.date(2024, 3, 26)

    # 시작 날짜와 종료 날짜를 선택하는 달력 생성
    
    # 선택한 날짜 범위 출력
    

    
    if select in df.columns:
        if st.checkbox('날짜 범위 지정하기'):
            start_date = st.date_input("시작 날짜", min_value=min_date, max_value=max_date, value=min_date)
            end_date = st.date_input("종료 날짜", min_value=min_date, max_value=max_date, value=max_date)
            st.write("선택한 날짜 범위:", start_date, "~", end_date)

            start_date2 = int(start_date.strftime('%Y%m%d'))
            end_date2 = int(end_date.strftime('%Y%m%d'))
            filtered_df = df[(df2.index >= start_date2) & (df2.index <= end_date2)]
            st.line_chart(filtered_df[select])

        else:
            st.line_chart(df[select])
    
    st.subheader('선택하신 지표간의 상관관계, 차트를 보여줍니다.')
    columns_list = st.multiselect('컬럼을 선택 하세요.', df.columns,key="unique_key_1")

    
    if len(columns_list) >= 1:
        #1. 페어플롯을 그린다.
        #todo : 1. pairplot 을 다른 라이브러리 이용해서 하는 방법
        # pairplot 말고, 반복문으로 두 컬럼씩 관계를 차트로 그리는 방법
        pair_plot = sb.pairplot(data=df, vars=columns_list ,kind="reg")
        pair_plot.fig.suptitle("corr",y=1.02)
        st.pyplot(pair_plot)

        #.상관계수 보여준다.
        st.dataframe(df[columns_list].corr())
        
        st.info("해석 : 상관관계는 보통 -1부터 1까지의 값을 가집니다. 이 값이 음수일 때와 양수일 때, 그리고 0에 가까울 때의 상관성을 설명하겠습니다.\n"
                "- +1에 가까울떄 : 한 변수가 증가할 때 따른 변수도 증가하는 경향이 있음을 나타냅니다. 선택하신 지표들의 상관관계가 +1에 가깝다면 두 지표가 비례관계임을 나타냅니다.\n"
                "- -1에 가까울떄 : 한 변수가 증가할 때 다른 변수는 감소하는 경향이 있음을 나타냅니다. 선택하신 지표들의 상관관계가 -1에 가깝다면 두 지표가 반비례 관계임을 나타냅니다\n"
                "- 0에 가까울때 : 두 지표간의 관계까 거의 없음을 의미합니다. 하지만 주의할 점은 상관관계가 0이라고 해서 두 변수 사이에 다른 종류의 관계가 없다는 것은 아닙니다.")

    


        # combinations_list = list(combinations(columns_list, 2))
        # for pair in combinations_list:
        #     pair_plot = sb.pairplot(data=df, vars=pair)
        #     st.pyplot(pair_plot)